FirstBlazeMeter_Test-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: FirstBlazeMeter Test-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: FirstBlazeMeter Test-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  FirstBlazeMeter Test-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1536,665)
      - go(http://localhost:8888/bank/login)
    - label: Login URL
      actions:
      - clickByID(username)
      - typeByID(username): "jsmith@demo.io"
      - clickByID(password)
      - typeByID(password): "Demo123!"
    - label: click on Sign in creds
      actions:
      - clickByID(submit)
      - clickByID(username)
      - clickByID(username)
      - doubleClickByID(username)
      - typeByID(username): "jsmith@demo.io"
      - clickByID(password)
      - typeByID(password): "Demo123!"
      - keysByID(password): KEY_ENTER
      - clickByID(username)
      - typeByID(username): "jsmith@demo.io"
      - clickByID(password)
      - typeByID(password): "Demo123!"
      - keysByID(password): KEY_ENTER
      - clickByID(username)
      - typeByID(username): "jsmith@demo.io"
      - clickByXPath(//form/div[2])
      - clickByID(password)
      - typeByID(password): "Demo123!"
      - clickByID(submit)
      - clickByID(username)
      - typeByID(username): "jsmith@demo.io"
      - clickByID(password)
      - typeByID(password): "Demo123!"
      - keysByID(password): KEY_ENTER
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(My Profile)
    - label: navigate to my profile
      actions:
      - clickByCSS(li.active)
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(Logout)

  FirstBlazeMeter Test-Http:
    headers:
      sec-ch-ua: '"Google Chrome";v="89", "Chromium";v="89", ";Not A Brand";v="99"'
      sec-ch-ua-mobile: '?0'
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/89.0.4389.90 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
      Sec-Fetch-Mode: navigate
      Sec-Fetch-User: '?1'
      Sec-Fetch-Dest: document
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:8888/bank/login'
            method: GET
            label: 'http://localhost:8888/bank/login'
            think-time: 0ms
            headers:
              Sec-Fetch-Site: none
      - transaction: Login URL
        force-parent-sample: false
        do:
          - url: 'http://localhost:8888/bank/login'
            method: GET
            label: 'http://localhost:8888/bank/login'
            think-time: 22389ms
            headers:
              Sec-Fetch-Site: none
      - transaction: click on Sign in creds
        force-parent-sample: false
        do:
          - url: 'http://localhost:8888/bank/login'
            method: POST
            label: 'http://localhost:8888/bank/login'
            think-time: 37044ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              Sec-Fetch-Site: same-origin
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
          - url: 'http://localhost:8888/bank/login'
            method: POST
            label: 'http://localhost:8888/bank/login'
            think-time: 10114ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              Sec-Fetch-Site: same-origin
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
          - url: 'http://localhost:8888/bank/login'
            method: POST
            label: 'http://localhost:8888/bank/login'
            think-time: 9433ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              Sec-Fetch-Site: same-origin
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
          - url: 'http://localhost:8888/bank/login'
            method: POST
            label: 'http://localhost:8888/bank/login'
            think-time: 22447ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              Sec-Fetch-Site: same-origin
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
          - url: 'http://localhost:8888/bank/login'
            method: GET
            label: 'http://localhost:8888/bank/login'
            think-time: 12434ms
            headers:
              Sec-Fetch-Site: same-origin
            body:
              error: ''
          - url: 'http://localhost:8881/bank/login'
            method: GET
            label: 'http://localhost:8881/bank/login'
            think-time: 66642ms
            headers:
              Sec-Fetch-Site: none
            body:
              error: ''
          - url: 'http://localhost:8881/bank/login'
            method: POST
            label: 'http://localhost:8881/bank/login'
            think-time: 9965ms
            headers:
              Content-Type: application/x-www-form-urlencoded
              Sec-Fetch-Site: same-origin
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
          - url: 'http://localhost:8881/bank/user/profile'
            method: GET
            label: 'http://localhost:8881/bank/user/profile'
            think-time: 13450ms
            headers:
              Sec-Fetch-Site: same-origin
      - transaction: navigate to my profile
        force-parent-sample: false
        do:
          - url: 'http://localhost:8881/bank/logout'
            method: GET
            label: 'http://localhost:8881/bank/logout'
            think-time: 34854ms
            headers:
              Sec-Fetch-Site: same-origin